In [1]:
import numpy as np
import pandas as pd

In [2]:
# Pandas  

# python으로 하는 excel
# datatype
# 1. Series <- numpy 1차원 vector
# 2. DataFrame <- series 여러개가 column으로 이어서 만들어진 matrix <- numpy matrix

### Series
* numpy array vector - index가 없다
* series <= numpy array vector  + index
* pd.Series()

In [4]:
L = [1, 2, 3, 4]
s = pd.Series(L)
s

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
L = [1, 2, 3, 4]
s = pd.Series(L, index = ['a', 'b', 'c', 'd'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
s['c']

3

In [9]:
s['c'] = 10
s

a     1
b     2
c    10
d     4
dtype: int64

In [10]:
s[['c', 'd']]

c    10
d     4
dtype: int64

In [12]:
s > 5      # broadcasting > element wise operating

a    False
b    False
c     True
d    False
dtype: bool

In [13]:
s[s > 5]  # boolean indexing

c    10
dtype: int64

In [14]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [15]:
'a' in s

True

In [16]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [21]:
s.index = ['가', '나', '다', '라']
s

가     1
나     2
다    10
라     4
dtype: int64

### DataFrame
* seires가 column 단위로 부터서 만들어진 matrix ( seires => dataframe )
* pd.DataFrame()

In [23]:
raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'may'],
           'last_name' : ['miller', np.nan, 'ali', 'milner', 'coozer'],
           'age': [42, np.nan, 36, 24, 73],
           'postestscore': [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'may'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'postestscore': [25, nan, nan, 62, 72]}

In [25]:
# dict key => columns
# value => columns 값 

df = pd.DataFrame(raw_data)
df

  first_name last_name   age  postestscore
0      jason    miller  42.0          25.0
1        NaN       NaN   NaN           NaN
2       tina       ali  36.0           NaN
3       jake    milner  24.0          62.0
4        may    coozer  73.0          72.0

In [26]:
# 데이터를 가공할 때 일반적, 보편적 처리 방식

# column - 특징을 칼럼으로 잡는다. 예) 학생, 학년, 이름, 주소, 성적, ...
# row - 개별 데이터값 예) 첫번째 학생, 두번째 학생

# column - feature, 열
# row - data, 행

In [27]:
# 하나의 칼럼- 하나의 series < np.array < 원소가 동일한 데이터타입으로 구성
# dataframe - series가 연결된 matrix

# 하나의 칼럼에는 동일한 타입의 데이터로 구성된다
# 칼럼간에는 다른 데이터타입의 칼럼들이 존재

In [ ]:
# column indexing >

In [28]:
df.head(2)

  first_name last_name   age  postestscore
0      jason    miller  42.0          25.0
1        NaN       NaN   NaN           NaN

In [29]:
df['first_name']

0    jason
1      NaN
2     tina
3     jake
4      may
Name: first_name, dtype: object

In [30]:
df[['last_name', 'age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    milner  24.0
4    coozer  73.0

In [33]:
df.first_name       # 이건 잘 안쓰임

# 속성으로 칼럼을 접근하는 방식
# 1. 칼럼 이름에 space가 있으면 안됨
# 2. 칼럼을 수정할 때 주의가 필요

0    jason
1      NaN
2     tina
3     jake
4      may
Name: first_name, dtype: object

In [35]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [36]:
df.columns

Index(['first_name', 'last_name', 'age', 'postestscore'], dtype='object')

In [37]:
df.values    # array

array([['jason', 'miller', 42.0, 25.0],
       [nan, nan, nan, nan],
       ['tina', 'ali', 36.0, nan],
       ['jake', 'milner', 24.0, 62.0],
       ['may', 'coozer', 73.0, 72.0]], dtype=object)

In [38]:
# row indexing

# df.loc[index name]
# df.iloc[index order num]

#loc[], iloc[] - row와 column을 동시에 선택할 수도 있다.

In [40]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

  first_name last_name   age  postestscore
a      jason    miller  42.0          25.0
b        NaN       NaN   NaN           NaN
c       tina       ali  36.0           NaN
d       jake    milner  24.0          62.0
e        may    coozer  73.0          72.0

In [41]:
df.loc['d']

first_name        jake
last_name       milner
age               24.0
postestscore      62.0
Name: d, dtype: object

In [42]:
df.iloc[3]

first_name        jake
last_name       milner
age               24.0
postestscore      62.0
Name: d, dtype: object

In [43]:
df.iloc[3:]

  first_name last_name   age  postestscore
d       jake    milner  24.0          62.0
e        may    coozer  73.0          72.0

In [44]:
df.loc['d':]

  first_name last_name   age  postestscore
d       jake    milner  24.0          62.0
e        may    coozer  73.0          72.0

In [45]:
df.loc[['c', 'e']]

  first_name last_name   age  postestscore
c       tina       ali  36.0           NaN
e        may    coozer  73.0          72.0

In [47]:
df.iloc[[2, 4]]

  first_name last_name   age  postestscore
c       tina       ali  36.0           NaN
e        may    coozer  73.0          72.0

In [48]:
df.loc['b':'d']

  first_name last_name   age  postestscore
b        NaN       NaN   NaN           NaN
c       tina       ali  36.0           NaN
d       jake    milner  24.0          62.0

In [49]:
df.loc['c', 'last_name']

'ali'

In [50]:
df.iloc[2, 1]

'ali'

In [52]:
df.loc[['c', 'd'], 'first_name' : 'age']

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [53]:
df.iloc[[2, 3], :3]

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [54]:
df.loc['d', 'pretestscore'] = 100
df

  first_name last_name   age  postestscore  pretestscore
a      jason    miller  42.0          25.0           NaN
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0          62.0         100.0
e        may    coozer  73.0          72.0           NaN

In [55]:
df.loc[['c', 'e'], ['age', 'postestscore']]

    age  postestscore
c  36.0           NaN
e  73.0          72.0

In [56]:
df.iloc[[2, 4], [2, 4]]

    age  pretestscore
c  36.0           NaN
e  73.0           NaN

In [59]:
df.loc['d':, 'pretestscore']

d    100.0
e      NaN
Name: pretestscore, dtype: float64

In [60]:
df.iloc[3:, 3:]

   postestscore  pretestscore
d          62.0         100.0
e          72.0           NaN

In [61]:
df.iloc[1:5:2, :]             # 홀수 인덱스

  first_name last_name   age  postestscore  pretestscore
b        NaN       NaN   NaN           NaN           NaN
d       jake    milner  24.0          62.0         100.0

In [62]:
# dataframe에 boolean indexing도 가능하다. => row indexing : loc[]

In [63]:
df

  first_name last_name   age  postestscore  pretestscore
a      jason    miller  42.0          25.0           NaN
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0          62.0         100.0
e        may    coozer  73.0          72.0           NaN

In [64]:
df.loc[df['age'] >= 40]

  first_name last_name   age  postestscore  pretestscore
a      jason    miller  42.0          25.0           NaN
e        may    coozer  73.0          72.0           NaN

In [66]:
# 'last_name'이 'ali'인 사람의 데이터를 출력하시오

df.loc[df['last_name'] == 'ali']

  first_name last_name   age  postestscore  pretestscore
c       tina       ali  36.0           NaN           NaN

In [70]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?

df.loc[df['age'] >= 40]['postestscore'].mean()

48.5

In [71]:
# 새로운 칼럼 추가

In [72]:
df['address'] = ['seoul', 'incheon', 'daejeon', 'pusan', 'gwangju']
df

  first_name last_name   age  postestscore  pretestscore  address
a      jason    miller  42.0          25.0           NaN    seoul
b        NaN       NaN   NaN           NaN           NaN  incheon
c       tina       ali  36.0           NaN           NaN  daejeon
d       jake    milner  24.0          62.0         100.0    pusan
e        may    coozer  73.0          72.0           NaN  gwangju

In [75]:
# 칼럼명 수정

df.columns = ['fn', 'ln', 'age', 'pres', 'posts', 'add']
df

      fn      ln   age  pres  posts      add
a  jason  miller  42.0  25.0    NaN    seoul
b    NaN     NaN   NaN   NaN    NaN  incheon
c   tina     ali  36.0   NaN    NaN  daejeon
d   jake  milner  24.0  62.0  100.0    pusan
e    may  coozer  73.0  72.0    NaN  gwangju

In [79]:
# df = df.rename(columns = {'add': 'address'})
df.rename(columns = {'add': 'address'}, inplace = True)          # 원본 바꾸기
df

      fn      ln   age  pres  posts  address
a  jason  miller  42.0  25.0    NaN    seoul
b    NaN     NaN   NaN   NaN    NaN  incheon
c   tina     ali  36.0   NaN    NaN  daejeon
d   jake  milner  24.0  62.0  100.0    pusan
e    may  coozer  73.0  72.0    NaN  gwangju

In [80]:
# column 또는 row를 삭제

In [83]:
df.drop('address', axis = 1, inplace = True)
df

      fn      ln   age  pres  posts
a  jason  miller  42.0  25.0    NaN
b    NaN     NaN   NaN   NaN    NaN
c   tina     ali  36.0   NaN    NaN
d   jake  milner  24.0  62.0  100.0
e    may  coozer  73.0  72.0    NaN

In [84]:
df.drop('c')        # df.drop('c', axis = 0)  row는 둘다 같음

      fn      ln   age  pres  posts
a  jason  miller  42.0  25.0    NaN
b    NaN     NaN   NaN   NaN    NaN
d   jake  milner  24.0  62.0  100.0
e    may  coozer  73.0  72.0    NaN

In [86]:
df.drop(['ln', 'pres'], axis = 1)

      fn   age  posts
a  jason  42.0    NaN
b    NaN   NaN    NaN
c   tina  36.0    NaN
d   jake  24.0  100.0
e    may  73.0    NaN